package p07_casting;

/*
 * 자식클래스인 Child에서 추가된 필드와 메소드는 
 * Parent타입으로 형변환되면 사용불가.

강제 타입 변환 ( Casting )

 부모 타입을 자식 타입으로 변환하는 것. 

모든 부모 타입을 자식 클래스의 타입으로 강제 변환할 수 있는 것은 아닙니다. 

자식 타입이 부모 타입으로 자동 변환한 후 다시 자식 타입으로 변환할 때 

강제 타입 변환을 사용할 수 있습니다.

자식클래스 변수 = (자식클래스)부모클래스타입;

                    자식  타입이 부모타입으로 변환된 상태
자식 타입이 부모 타입으로 자동 변환하면, 부모 타입에 선언된 필드와 메서드만 사용가능하다는 제약 사항이 따릅니다. 자식 타입에 선언된 필드와 메서드를 꼭 사용해야 한다면 강제 타입 변환을 해서 다시 자식 타입으로 변환한 다음 자식 타입의 필드와 메서드를 사용하면 됩니다.
 
 */
public class Child extends Parent{

	//자식클래스에서 추가된 필드
	public String field2;
	
	//자식클래스에서 추가된 메소드
	public void method3() {
		System.out.println("child-method3");
	}
}
